Repository: abdukerimovislam/bloom
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Track your cycle
ru: Отслеживай свой цикл

# lastPeriod
source: Last Period: {date}
ru: Последний цикл: {date}

# noData
source: No data yet. Log your first cycle!
ru: Пока нет данных. Отметь свой первый цикл!

# avatarStateResting
source: Resting...
ru: Отдыхаю...

# avatarStateActive
source: Active!
ru: Активна!

# calendarTitle
source: Cycle Calendar
ru: Календарь цикла

source: Save
ru: Сохранить

# tapToLogPeriod
source: Tap a day to log or unlog it
ru: Нажми на день, чтобы отметить/снять отметку

# logSymptomsButton
source: How do you feel today?
ru: Как ты себя чувствуешь?

# symptomsTitle
source: Today's Symptoms
ru: Симптомы сегодня

# symptomCramps
source: Cramps
ru: Спазмы

# symptomHeadache
source: Headache
ru: Головная боль

# symptomNausea
source: Nausea
ru: Тошнота

# moodHappy
source: Happy
ru: Радость

# moodSad
source: Sad
ru: Грусть

# moodIrritable
source: Irritable
ru: Раздражение

# noSymptomsLogged
source: No symptoms logged for today.
ru: Симптомы не отмечены.

# predictionsTitle
source: Predictions
ru: Прогнозы

# nextPeriodPrediction
source: Next period in ~{days} days
ru: Следующий цикл ~ через {days} д.

# nextPeriodDate
source: Around {date}
ru: Примерно {date}

source: Fertile Window
ru: Фертильное окно

# ovulation
source: Est. Ovulation
ru: Овуляция

# cycleLength
source: Avg. Cycle: {days} days
ru: Средний цикл: {days} д.

# periodLength
source: Avg. Period: {days} days
ru: Средняя длит.: {days} д.

# notEnoughData
source: Log at least 2 cycles to see predictions.
ru: Нужно 2+ цикла для прогноза.

# calendarLegendPeriod
source: Your Period
ru: Ваш цикл

# calendarLegendPredicted
source: Predicted Period
ru: Прогноз цикла

# calendarLegendFertile
source: Fertile Window
ru: Фертильное окно

# welcomeTitle
source: Welcome to Bloom!
ru: Добро пожаловать в Bloom!

# welcomeDesc
source: Your personal cycle pal. Let's get you set up.
ru: Твой личный друг для цикла. Давай настроим приложение.

# questionPeriodTitle
source: When did your last period start?
ru: Когда начался твой последний цикл?

# questionPeriodDesc
source: You can log this in the calendar. If you don't remember, that's okay!
ru: Ты можешь отметить это в календаре. Если не помнишь — не страшно!

# questionLengthTitle
source: What's your average cycle length?
ru: Какая у тебя средняя длина цикла?

# questionLengthDesc
source: This is the time from one period start to the next. (Default is 28 days)
ru: Это время от начала одного цикла до начала следующего. (По умолчанию 28 дней)

source: Skip
ru: Пропустить

source: Done
ru: Готово

source: Pick a date
ru: Выбрать дату

source: days
ru: дней

# settingsTitle
source: Settings
ru: Настройки

# settingsNotifications
source: Notifications
ru: Уведомления

# settingsNotificationsDesc
source: Show alerts for predictions
ru: Показывать оповещения о прогнозах

# settingsLanguage
source: Language
ru: Язык

# settingsSupport
source: Support
ru: Поддержка

# settingsSupportDesc
source: Report a bug or ask a question
ru: Сообщить об ошибке или задать вопрос

# notificationPeriodTitle
source: Heads up from Bloom!
ru: Bloom напоминает!

# notificationPeriodBody
source: Your period is predicted to start in {days} days.
ru: Твой цикл, возможно, начнется через {days} дня.

# notificationFertileTitle
source: Heads up from Bloom!
ru: Bloom напоминает!

# notificationFertileBody
source: Your fertile window is predicted to start tomorrow.
ru: Твое фертильное окно, возможно, начнется завтра.

# logPeriodStartButton
source: Period Started Today
ru: Цикл начался сегодня

# logPeriodEndButton
source: Period Ended Today
ru: Цикл закончился сегодня

# periodIsActive
source: You are on day {day} of your period
ru: У тебя {day} день цикла

# periodDelayed
source: Period is {days} days late
ru: Задержка {days} д.

# avatarStateDelayed
source: Waiting...
ru: Ожидание...

# avatarStateFollicular
source: Energy is returning!
ru: Энергия возвращается!

# avatarStateOvulation
source: Peak energy!
ru: Пик энергии!

# avatarStateLuteal
source: Time to rest
ru: Время отдохнуть

# insightNone
source: Log your first cycle in the calendar to start seeing insights!
ru: Отметь свой первый цикл в календаре, чтобы видеть советы!

# insightMenstruation_1
source: Time for coziness! Your energy is at its lowest - that's okay. Remember to rest, watch your favorite show, and maybe eat that chocolate bar. üç´
ru: Время для уюта! Твоя энергия на минимуме — это нормально. Не забудь отдохнуть, посмотреть любимый сериал и, может быть, съесть ту самую шоколадку. 🍫

# insightMenstruation_2
source: Your body is doing hard work. Listen to it! Gentle stretching or a warm bath can do wonders for cramps.
ru: Твое тело усердно работает. Прислушайся к нему! Легкая растяжка или теплая ванна могут творить чудеса.

# insightMenstruation_3
source: It's normal to feel tired. Your hormones are at their lowest. Prioritize sleep and hydration today.
ru: Чувствовать усталость — это нормально. Твои гормоны на самом низком уровне. Сон и вода — твои лучшие друзья сегодня.

# insightFollicular_1
source: Energy is returning! Estrogen is rising. Great day to make plans or do that workout you've been putting off.
ru: Энергия возвращается! Эстроген на подъеме. Отличный день, чтобы составить планы или заняться спортом, который ты откладывала.

# insightFollicular_2
source: Your mind is getting clearer. This is a great time to learn something new or tackle a tricky problem.
ru: Твой ум проясняется. Это отличное время, чтобы выучить что-то новое или решить сложную задачу.

# insightFollicular_3
source: Mood boost! As your period ends, you might feel more positive and sociable. Enjoy it!
ru: Настроение вверх! Цикл заканчивается, и ты можешь чувствовать себя более позитивно и общительно. Наслаждайся!

# insightOvulation_1
source: You're peaking! üåü Today is your day to shine. Confidence and energy are at their maximum. Perfect time for challenging tasks or socializing.
ru: Ты на пике! 🌟 Сегодня твой день, чтобы блистать. Уверенность и энергия на максимуме. Идеальное время для сложных задач или общения.

# insightOvulation_2
source: You might feel extra confident today. It's the estrogen peak! A great day to speak up or lead a project.
ru: Ты можешь чувствовать себя особенно уверенно. Это пик эстрогена! Отличный день, чтобы высказать свое мнение или возглавить проект.

# insightOvulation_3
source: Peak energy! Your body is ready for more intense exercise if you feel up for it. You might also feel more connected to others.
ru: Пик энергии! Твое тело готово к более интенсивным тренировкам, если ты в настроении. Ты также можешь чувствовать особую связь с другими.

# insightLuteal_1
source: You might feel a bit irritable or tired - blame progesterone. This is called PMS. Be kinder to yourself, now is the time for self-care.
ru: Ты можешь чувствовать себя немного раздражительной или уставшей — это виноват прогестерон. Это называется ПМС. Будь нежнее к себе, сейчас время для заботы.

# insightLuteal_2
source: Food cravings? It's normal. Your body is burning more calories. Opt for complex carbs or dark chocolate to stay balanced.
ru: Тянет на еду? Это нормально. Твое тело сжигает больше калорий. Выбирай сложные углеводы или темный шоколад, чтобы сохранить баланс.

# insightLuteal_3
source: Feeling a bit bloated or sensitive? It's the luteal phase. Try to reduce salt and drink extra water. It helps!
ru: Чувствуешь вздутие или чувствительность? Это лютеиновая фаза. Попробуй уменьшить количество соли и пить больше воды. Это помогает!

# insightDelayed_1
source: Period delayed? Small fluctuations are normal, stress or changes in routine can be the cause. Just keep track.
ru: Задержка? Небольшие сбои — это нормально, причиной может быть стресс или изменение ритма жизни. Просто держи в курсе.

# insightDelayed_2
source: Waiting... It's common to be off by a day or two. Try to relax, get good sleep, and see what happens tomorrow.
ru: Ожидание... Опоздание на пару дней — это обычное дело. Постарайся расслабиться, хорошо выспаться и посмотреть, что будет завтра.

# insightDelayed_3
source: Your body has its own rhythm. A late period can happen for many reasons. If you're worried, you can always talk to a trusted adult.
ru: У твоего тела свой ритм. Задержка может случиться по многим причинам. Если ты беспокоишься, ты всегда можешь поговорить со взрослым, которому доверяешь.

# settingsTheme
source: App Theme
ru: Тема приложения

# themeRose
source: Gentle Rose
ru: Нежная Роза

# themeNight
source: Moonlit Night
ru: Лунная Ночь

# themeForest
source: Forest Calm
ru: Лесное Спокойствие
